In [2]:
#import necessary libraries
import pandas as pd
from sqlalchemy import create_engine

In [35]:
#bring in csv from files
streaming_csv = "Resources/MoviesOnStreamingPlatforms_updated.csv"
streaming_df = pd.read_csv(streaming_csv)
streaming_df.head()

new_streaming_df = streaming_df[['Title','Year','IMDb','Rotten Tomatoes','Netflix','Hulu','Prime Video','Disney+','Genres','Country','Language','Runtime']]

new_streaming_df.head()

Title               object
Year                 int64
IMDb               float64
Rotten Tomatoes     object
Netflix              int64
Hulu                 int64
Prime Video          int64
Disney+              int64
Genres              object
Country             object
Language            object
Runtime            float64
dtype: object

In [8]:
#bring in csv from files
IMDB_movies_csv = "Resources/IMDb_movies.csv"
IMDB_movies_df = pd.read_csv(IMDB_movies_csv)
IMDB_movies_df.head()

new_IMDB_movies_df = IMDB_movies_df[['imdb_title_id','title','year','description']]
new_IMDB_movies_df.head()

C:\Users\Julie\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,imdb_title_id,title,year,description
0,tt0000009,Miss Jerry,1894,The adventures of a female reporter in the 1890s.
1,tt0000574,The Story of the Kelly Gang,1906,True story of notorious Australian outlaw Ned ...
2,tt0001892,Den sorte drøm,1911,Two men of high rank are both wooing the beaut...
3,tt0002101,Cleopatra,1912,The fabled queen of Egypt's affair with Roman ...
4,tt0002130,L'Inferno,1911,Loosely adapted from Dante's Divine Comedy and...

In [41]:
titles_csv = "Resources/IMDb_title.csv"
titles_df = pd.read_csv(titles_csv)
titles_df.head()
clean_titles_df = titles_df[['imdb_title_id','imdb_name_id','category']]
clean_titles_df = pd.merge(new_streaming_df,new_IMDB_movies_df,how="inner",left_on=['Title','Year'],right_on=['title','year'])

clean_titles_df = clean_titles_df.drop(['title','year'],axis=1)

clean_titles_df.head()

,Title,Year,IMDb,Rotten Tomatoes,Netflix,Hulu,Prime Video,Disney+,Genres,Country,Language,Runtime,imdb_title_id,description
0,Inception,2010,8.8,87%,1,0,0,0,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0,tt1375666,A thief who steals corporate secrets through t...
1,Django Unchained,2012,8.4,87%,1,0,0,0,"Drama,Western",United States,"English,German,French,Italian",165.0,tt1853728,"With the help of a German bounty hunter, a fre..."
2,Taxi Driver,1976,8.3,95%,1,0,0,0,"Crime,Drama",United States,"English,Spanish",114.0,tt0075314,A mentally unstable veteran works as a nightti...
3,3 Idiots,2009,8.4,100%,1,0,1,0,"Comedy,Drama",India,"Hindi,English",170.0,tt1187043,Two friends are searching for their long lost ...
4,The Social Network,2010,7.7,96%,1,0,0,0,"Biography,Drama",United States,"English,French",120.0,tt1285016,As Harvard student

In [22]:
names_csv = "Resources/IMDb_names.csv"
names_df = pd.read_csv(names_csv)
names_df.head()

,imdb_name_id,name,birth_name,height,bio,birth_details,date_of_birth,place_of_birth,death_details,date_of_death,place_of_death,reason_of_death,spouses_string,spouses,divorces,spouses_with_children,children
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...","May 10, 1899 in Omaha, Nebraska, USA",1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987-06-22,"Los Angeles, California, USA",pneumonia,Robyn Smith (27 June 1980 - 22 June 1987) (hi...,2,0,1,2
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,"September 16, 1924 in The Bronx, New York City...",1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014-08-12,"New York City, New York, USA",stroke,Jason Robards (4 July 1961 - 10 September 196...,2,1,2,3
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...","September 28, 1934 in Paris, France",1934-09-28,"Paris, France",NaN,NaN,NaN,NaN,Bernard d'Ormale (16 August 1992 - present)\n...,4,3,1,1
3,nm0000004,John Belushi,John Adam Belushi,170.0,"John Belushi was born in Chicago, Illinois, US...","January 24, 1949 in Chicago, Illinois, USA",1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982-03-05,"Hollywood, Los Angeles, California, USA",acute cocaine and heroin intoxication,Judith Belushi-Pisano (31 December 1976 - 5 M...,1,0,0,0
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...","July 14, 1918 in Uppsala, Uppsala län, Sweden",1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden (...",2007-07-30,"Fårö, Gotlands län, Sweden",natural causes,Ingrid Bergman (11 November 1971 - 20 May 199...,5,4,5,8

In [42]:
clean_names_df = names_df[['imdb_name_id','name','date_of_birth','date_of_death','place_of_birth','place_of_death']]
clean_names_df.head()

,imdb_name_id,name,date_of_birth,date_of_death,place_of_birth,place_of_death
0,nm0000001,Fred Astaire,1899-05-10,1987-06-22,"Omaha, Nebraska, USA","Los Angeles, California, USA"
1,nm0000002,Lauren Bacall,1924-09-16,2014-08-12,"The Bronx, New York City, New York, USA","New York City, New York, USA"
2,nm0000003,Brigitte Bardot,1934-09-28,NaN,"Paris, France",NaN
3,nm0000004,John Belushi,1949-01-24,1982-03-05,"Chicago, Illinois, USA","Hollywood, Los Angeles, California, USA"
4,nm0000005,Ingmar Bergman,1918-07-14,2007-07-30,"Uppsala, Uppsala län, Sweden","Fårö, Gotlands län, Sweden"